tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "louisbrunner/valgrind"
brew "automake"
brew "python@3.10"
brew "awscli"
brew "bat"
brew "black"
brew "fontconfig"
brew "glib"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "docker", link: false
brew "exa"
brew "figlet"
brew "flake8"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "grip"
brew "htop"
brew "imagemagick"
brew "ipython"
brew "isort"
brew "jo"
brew "lorem"
brew "macvim"
brew "node"
brew "markdownlint-cli"
brew "neofetch"
brew "pandoc"
brew "pdfgrep"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-yq"
brew "python@3.8"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "tldr"
brew "tmux"
brew "tree"
brew "yamllint"
brew "yapf"
brew "zsh"
brew "zsh-completions"
cask "julia"
cask "mactex"
cask "skim"
