tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "automake"
brew "python@3.10"
brew "awscli"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "black"
brew "bpython"
brew "fontconfig"
brew "glib"
brew "gnutls"
brew "cask"
brew "clang-format"
brew "cmake"
brew "ctags"
brew "docker"
brew "exa"
brew "exercism"
brew "figlet"
brew "flake8"
brew "fswatch"
brew "fzf"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "grip"
brew "htop"
brew "ipython"
brew "isort"
brew "llvm"
brew "lorem"
brew "ruby"
brew "macvim"
brew "node"
brew "markdownlint-cli"
brew "neofetch"
brew "pandoc"
brew "pgformatter"
brew "pipenv"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "tldr"
brew "tmux"
brew "tree"
brew "uncrustify"
brew "watch"
brew "wget"
brew "yamllint"
brew "yapf"
brew "zsh"
brew "zsh-completions"
cask "anki"
cask "caffeine"
cask "discord"
cask "slack"
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "iterm2"
cask "julia"
cask "mactex"
cask "rectangle"
cask "notion"
cask "rescuetime"
cask "skim"
cask "google-chrome"
cask "freedom"
cask "spotify"
cask "vlc"
